Revit 2026 API

# BuiltInFailuresRevisionFailures Class

---

Failures about Revision Settings.

SystemObject Autodesk.Revit.DBBuiltInFailuresRevisionFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class RevisionFailures
```
```vb
Public NotInheritable Class RevisionFailures
```
```cpp
public ref class RevisionFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RevisionFailures = class end
```

The BuiltInFailuresRevisionFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RevisionSettingsDuplicateName | More than one Revisons have the same name %1!s!. |

#### Reference

Autodesk.Revit.DB Namespace